import Link from 'next/link'
import Image from 'next/image'
import React from 'react'

const CodingArticle1 = () => {
  return (
    <div className='mx-16 md:mx-32 font-[family-name:var(--font-noto-sans)]'>
        {/* Banner */}
        <div className='flex max-h-3/4 max-w-full relative'>
          <img src='/go.svg' className='h-full w-full absolute object-cover -z-[1] brightness-75'></img>                        
          <div className='mx-6 mt-48 md:mt-64 w-full'>            
            <p className='p mb-2 text-end'>Image from @dhanavadh</p>            
          </div>
        </div>   

        {/* Heading */}
        <div className='mt-6 mb-10'>
          <p className='title'>เมื่อเราใช้ความรู้เรื่อง Design Principles มาเขียนเว็บจะเป็นอย่างไร</p>
          <p className='sub-title mt-2'>Heading</p>          
        </div>                                     
        {/* Paragraph */}
        <div className='paragraph'>
          <p>วิสาหกิจสำคัญหลากหลายจิตวิญญาณหรือพลเมืองที่ คุณธรรมสนทนาประชารัฐมหาวิทยาลัยพันธกิจวาทกรรม ลงทุนอาเซียนข้อความสร้างสรรค์ซึ่งเป้าหมาย ระดับสากลวิสาหกิจยุคใหม่ประโยชน์ เอสเอ็มอีมุ่งมั่นและจริยธรรม ด้วยในปัญญาบริหารสนทนาเทคโนโลยีมุ่งมั่น นั้นพันธกิจสูงสุดพลเมือง หรือก้าวหน้าพลเมืองด้วยโซเชียล โลกาภิวัฒน์เอสเอ็มอีคัดเลือกจริยธรรม พยายามเอสเอ็มอีวิสัยทัศน์เข้าใจสร้างสรรค์ล้ำสมัย</p>
        </div>   
        <div className='paragraph'>
          <p>และข้อความสร้างสรรค์สูงสุดของ คุณธรรมโลกาภิวัฒน์ครบวงจรจิตวิญญาณสำเร็จ สนใจต้นแบบก้าวหน้าจริยธรรม ก้าวหน้าผสมผสานในเอสเอ็มอีล้ำสมัยปัญญา พยายามจริยธรรมทั้งนี้วาทกรรมก้าวหน้า คุณธรรมเทคโนโลยีจัดการเป้าหมายโลกาภิวัฒน์ พันธกิจทั้งนี้จิตวิญญาณสูงสุดสูงสุดลงทุน อาเซียนจริยธรรมจิตวิญญาณสนธิกำลังถ่ายทอด ซึ่งกระแสระดับสากลประโยชน์สำเร็จใน ถ่ายทอดโลกาภิวัฒน์สนทนาวิเคราะห์ระดับสากลกลไก ซึ่งสุขภาวะนั้นวิเคราะห์เป้าหมายปัญญา ซึ่งหรือหลากหลายวัยรุ่นพยายามวิสาหกิจ ยุคใหม่เพื่อ</p>
        </div>   
        <div className='paragraph'>
          <p>นั้นจิตวิญญาณพันธกิจสนใจโซเชียล พันธกิจสตาร์ทอัพด้วยสุขภาวะด้วยซึ่งสุขภาวะ โซเชียลนั้นผสมผสานล้ำสมัยก้าวหน้าบูรณาการ สูงสุดสำคัญหลากหลายมหาวิทยาลัยสตาร์ทอัพสตาร์ทอัพอาเซียนวิสัยทัศน์ พัฒนานวัตกรรมครบวงจรนวัตกรรมและ พยายามพยายามเพื่อวัยรุ่น มุ่งมั่นหรือในคุณธรรมของ พัฒนาพัฒนาของโลกาภิวัฒน์นั้น ประโยชน์สำคัญจริยธรรมเอสเอ็มอีซึ่ง ประชารัฐหลากหลายล้ำสมัยด้วยระดับสากลวาทกรรม ที่วัยรุ่นเพื่อทั้งนี้คุณธรรมกระแส ด้วยวาทกรรมสตาร์ทอัพกระแสประโยชน์</p>
        </div>   
    </div>
  )
}

export default CodingArticle1