<section class="flex flex-col w-full max-w-md mx-auto p-6 pt-0 min-h-screen gap-6">
	<div class="header">
		<p class="mb-2">Article</p>
		<h1 class="text-4xl">日本における就職活動</h1>
	</div>
	<div class="paragraph">
		<p>
			現在、日本の就職活動、いわゆる「就活」についていえば、多くの学生がインターンシップに参加することがよく見られ、卒業後すぐに働く学生もよく見られる。だが、タイの状況を見ると、学生の就活に対する関心は日本ほど高くないように思われる。そして、日本とタイの大学生のインターンシップ参加率を比べると、日本のほうが一般的に高いと思われている。これらの違いをよく見ると、タイと日本は社会的文化や政府からの支援が異なっており、両国の就活に違いを与えていると言える。
		</p>
		<p>
			タイでは、日本貿易振興機構（2020）によると、だいたい、学生は在学中に就活を行うことはあるが、卒業後が就活の始まりだと考えている人がよく見られる。一方、キャリアパーク（2020）では、日本では、多くの大学生が大学生活の一環として就活に集中していると述べている。また、厚生労働省（2020）によれば、日本は新卒一括採用という慣行がある。この慣行はどこの学部から卒業したかに関わらず、在学中に募集を行い、卒業後に直結したスキルのない新卒者であっても、就職することができるという雇用慣行である。タイの教育制度に対する価値観タイでは理系・文系に対する価値観が強いため、日本のように、学部や専攻に関係なく、幅広い分野の卒業生が対象となる新卒一括採用はタイでほとんど見かけられない。それで、大学生活の一部となる就活の価値観と日本の独特の雇用慣行をよく考察すると、両国の違いの要因の一つを指摘することができると言える。
		</p>
		<p>
			また、政府の観点に注目してみれば、日本の政府は大学生にインターンシップの支援を与えている一方、タイの政府は大学生のためのインターンシップ推進や職業を意識させる計画などがない。文部科学省（2014）によれば、日本での文部科学省、通商産業省、労働省いわゆる３省合意は、インターンシップの推進の合意を立て、学生に主体的な職業選択や高い職業意識の育成の考えを支援した。この推進は、両国における国の将来を担う若者に対する価値観が違っており、就職活動の違いを与える原因の一つだと言えないだろうか。
		</p>
		<p>
			さらに、両国の転職に対する観点は、社会的文化の違いとして、就活の違いの原因を作り出す傾向があると考えられる。小野浩（2016）によって、日本では、長期雇用の文化が根付いており、企業に対する忠誠心が非常に重視されるという。また、Samra
			et al.
			(2024)は、転職が多いことは、ネガティブなイメージを招く傾向があると見られる。日本では転職が多いことに対してマイナスイメージを持つ人が多いのに対し、タイでは転職が比較的一般的で、ポジティブなイメージを持つ人が多いと思われる。そのため、日本の大学生は安定した仕事を長期間続けることを重視し、在学中から積極的に就活を始めると思わせる。一方で、タイの大学生はそのようなイメージを持っていないため、卒業後に就活を始める人が多いように見られる。このような転職に対する価値観の違いが根付いていることことは、両国の就活の取り組みを異なるものにし、就職活動の違いを生み出す要因の一つであると言えるだろう。
		</p>
	</div>
</section>
