import Author from '@/app/components/BlogElemet/Author'
import Image from 'next/image'
import Link from 'next/link'
import React from 'react'

const Reference = [
    {
        id: 1,
        name: 'Destiny. (2017). In K. T. S. Sarao & J. D. Long (Eds.), Buddhism and Jainism (pp. 363-363). Springer Netherlands.',
        link: 'https://doi.org/10.1007/978-94-024-0852-2_100226'
    },
    {
        id: 2,
        name: 'Goodman, C. (2002). Resentment and Reality: Buddhism on Moral Responsibility. American Philosophical Quarterly, 39(4), 359-372. ',
        link: 'http://www.jstor.org.chula.idm.oclc.org/stable/20010085'
    },
    {
        id: 3,
        name: 'Gómez, L. O. (1975). Some Aspects of the Free-Will Question in the Nikāyas. Philosophy East and West, 25(1), 81–90. ',
        link: 'https://doi.org/10.2307/1398436'
    },
    {
        id: 4,
        name: 'Griffiths, P. J. (1982). Notes Towards a Critique of Buddhist Karmic Theory. Religious Studies, 18(3), 277-291.',
        link: 'http://www.jstor.org.chula.idm.oclc.org/stable/20005861'
    },
    {
        id: 5,
        name: 'Harvey, P. F. (2007). "Freedom of the Will" in the Light of Theravada Buddhist Teachings. The Journal of Buddhist Ethics, 14, 35. ',
        link: 'https://blogs.dickinson.edu/buddhistethics/files/2010/05/harvey2-article1.pdf'
    },
    {
        id: 6,
        name: 'Kumar, N., & Sethy, S. S. (2023). Buddhism and no-Self Theory: Examining the Relation between Human Actions and Moral Responsibility. Philosophia, 51(1), 205-216. ',
        link: 'https://doi.org/10.1007/s11406-021-00347-1'
    },
    {
        id: 7,
        name: 'Repetti, R. (2010). Earlier Buddhist Theories of Free Will: Compatibilism. The Journal of Buddhist Ethics, 17, 277-310. ',
        link: 'https://academicworks.cuny.edu/cgi/viewcontent.cgi?article=1117&context=kb_pubs'
    },
    {
        id: 8,
        name: 'Repetti, R. (2014). Recent Buddhist Theories of Free Will: Compatibilism, Incompatibilism, and Beyond. The Journal of Buddhist Ethics, 21, 279.',
        link: 'https://blogs.dickinson.edu/buddhistethics/files/2014/01/Repetti-Recent-Final2.pdf'
    },
    {
        id: 9,
        name: 'เทพพร มังธานี. (2021). อิทัปปัจจยตาทางจริยศาสตร์. วารสารปณิธาน, 17(1), 119-142.',
        link: 'https://so05.tci-thaijo.org/index.php/panidhana/article/view/249797'
    },
    {
        id: 10,
        name: 'Tok.Wiki. (n.d.). อาชิวิกา นิรุกติศาสตร์และความหมายและประวัติศาสตร์.',
        link: 'https://hmong.in.th/wiki/Ajivika'
    },

]

const BlogBuddhism = () => {
  return (
    <div className='blog-panel'>
        {/* Banner */}
        <div className='flex max-h-3/4 min-w-full relative -z-[1]'>
          <img src='http://stageengine.iconroof.co.th/public/asset/pers/banner/buddhism.svg' className='blog-banner'></img>                        
          <div className='blog-banner-object'>            
            <p className='ref-image'>Image from @dhanavadh</p>            
          </div>
        </div>   

        {/* Heading */}
        <div className='blog-heading'>
            <p className='blog-reading'>20 minutes Reading</p>
          <p className='title'>พุทธศาสนาและเจตจำนงเสรีบางประการ</p>
          <p className='sub-title-article mt-2'>แนวคิดพุทธศาสนาเกี่ยวกับเจตจำนงเสรีนั้นมีจริงหรือไม่ และถ้ามีจริง มีผลต่อการทำความเข้าใจเรื่องการกระทำของมนุษย์หรือไม่? แล้วถ้าเกิดพุทธศาสนาไม่มีเจตจำนงเสรี ผลของการรับผิดชอบเรื่องกรรมจะตกที่ใคร?</p>          
        </div>                                     
        {/* Paragraph */}
        <div className='max-w-[1000px]'>
          <div className='paragraph'>
            <p>หนึ่งในปัญหาที่เกิดการตั้งคำถามกับพุทธศาสนาคือเรื่อง เจตจำนงเสรี (free will) และ นิยัตินิยม (determinism) ประเด็นศึกษาดังกล่าวมีการศึกษาที่หลากหลายและนำเสนอในมุมมองที่แตกต่างกันไป การยกประเด็นศึกษาเรื่องเจตจำนงเสรีในพุทธศาสนานั้น อาจเป็นเนื่องมาจากที่ว่าพุทธศาสนาไม่ได้มีมุมมองหรือให้นิยมที่ชัดเจนว่าเป็นโลกทัศน์ที่มนุษย์มีเจตจำนงเสรี แต่ก็อาจมีหลักธรรมที่สามารถให้ข้อเสนอเกี่ยวกับเรื่องดังกล่าวได้ในหลายหลักธรรม (Nishant, pp.212) อย่างไรก็ดี ในการศึกษาครั้งนี้จะศึกษาโดยการยกตัวอย่างเหตุการณ์ที่ดูมีลักษณะแบบที่ถูกกำหนดมาแล้ว และหาช่องทางที่เป็นไปได้เพื่อตอบปัญหาเกี่ยวกับเจตจำนงเสรีในพุทธศาสนา</p>
          </div>   
          <div className='paragraph'>
            <p>เมื่อเราลองพิจารณาเหตุการณ์ที่ว่า</p>
          </div>   
          <div className='paragraph italic border-l-4 border-pink-500 pl-4'>
            <p>มีสงครามและมีการเกณฑ์ทหารเพื่อไปทำสงคราม และในสงครามนั้นมีการฆ่าล้างเผ่าพันธุ์เกิดขึ้น ทหารที่ถูกเกณฑ์ไปทั้งหมดถูกสั่งให้ทำการฆ่าผู้คน หากมีทหารที่ไม่ไปเกณฑ์ และทำตามคำสั่งจะถูกฆ่าเช่นเดียวกัน</p>
          </div>  
          <div className='paragraph'>
            <p>จากเหตุการณ์ดังกล่าว หากเรามองที่การกระทำของทหารที่ว่าจะต้องไปฆ่าคน เมื่อมองในโลกทัศน์ทางพุทธศาสนา อาจเกิดการตั้งคำถามถึงเจตจำนงเสรีในทางพุทธศาสนาว่ามีหรือไม่ การกระทำของทหาร ทหารในสถานการณ์นั้น ๆ มีเจตจำนงเสรีหรือไม่ หรือทุกอย่างที่เกิดขึ้น ถูกกำหนดมาแล้ว หากพุทธศาสนามองว่าโลกใบนี้ไม่มีเจตจำนงเสรี อาจนำไปเป็นประเด็นศึกษาต่อที่ว่า หากโลกใบนี้ไม่มีเจตจำนงเสรี ผู้รับผิดชอบจากการกระทำจะตกอยู่ที่ใคร ผู้เขียนมองว่าการตั้งเหตุการณ์ดังกล่าวหากมองในแง่มุมที่ต่างกัน ก็ให้ผลลัพธ์ออกมาแตกต่างกัน หากเราเชื่อว่าโลกทางพุทธศาสนานี้มีเจตจำนงเสรีอยู่จริงในบางส่วน ก็จะยอมรับได้ก็ต่อเมื่อเราเปลี่ยนเงื่อนไขให้ว่า ทหารที่จะฆ่าคนตัดสินใจขัดคำสั่งและยอมตายเอง</p>
          </div>   
          <div className='paragraph'>
            <p>อย่างไรก็ดี ในงานเขียนชิ้นนี้ต้องการศึกษาเน้นที่ว่า โลกทัศน์ทางพุทธศาสนายังมีช่องว่างให้ยอมรับว่าโลกทัศน์นี้มองว่ามนุษย์ยังพอมีเจตจำนงเสรีในบางประการ เหตุการณ์ที่ต้องฆ่าคนโดยที่ไม่สมัครใจนั้นยังมีทางที่ทำให้ยอมรับได้ว่ามนุษย์ยังมีเจตจำนงเสรีบางประการ</p>
          </div>   
          <div className='paragraph'>
            <p>หากยึดถือตามหลักเหตุปัจจัย แนวคิดเจตจำนงเสรีอาจไม่สามารถนำมาใช้ได้กับหลักนี้ หากนึกถึงความเป็นไปของโลก สิ่งที่เกิดขึ้นต่าง ๆ ของโลก การเกิดขึ้นหรือดับไปของสิ่งต่าง ๆ เมื่ออธิบายทางพุทธศาสนา ก็อาจมองโลกไปตามหลักอิทัปปัจจยตา คือ ความมีสิ่งนี้ เป็นปัจจัย สิ่งนี้ จึงมีหรือเกิดขึ้น หมายถึงทุกสิ่งมีปัจจัยแห่งการเกิดและดับ เมื่อปัจจัยแห่งการเกิดมีแก่สิ่งใด สิ่งนั้นก็เกิดขึ้นหรือมีอยู่ เมื่อไม่มีปัจจัยแก่สิ่งใด สิ่งนั้นก็ไม่เกิดขึ้นหรือไม่มีอยู่ (เทพพร, pp.127) กล่าวอีกนัยคือ พุทธศาสนามองว่าโลกใบนี้ล้วนมีเหตุประกอบกันเกิด เมื่อเกิดผลใด ๆ ย่อมมีเหตุที่ทำให้เกิด อีกทั้งใน (Goodman, 2001) ได้ให้ข้อสนับสนุนว่าพุทธแบบเถรวาสยังมองว่าทุก ๆ การกระทำมีเหตุประกอบ และไม่มีสิ่งที่เรียกว่าความบังเอิญ</p>
          </div>   
          <div className='paragraph'>
            <p>(Goodman, 2001) อ้างว่าหากพิจารณาตามหลักกรรมในพุทธศาสนา ปัจจัยต่างๆ ที่กำหนดการกระทำของมนุษย์ จะต้องมาจากหนึ่งในสามแหล่งต่อไปนี้ หากการกระทำเกิดจากปัจจัยที่กำหนดโดยกรรม ก็เท่ากับว่าการกระทำนั้นถูกกำหนดไว้ล่วงหน้าแล้ว และเสนออีกว่า หากการกระทำเกิดจากปัจจัยอื่นที่ไม่ใช่กรรม ปัจจัยนั้นก็ต้องมาจากตัวตน หรือสิ่งอื่นที่ไม่ใช่ตัวตน หรือหากปัจจัยนั้นมาจากสิ่งอื่นที่ไม่ใช่ตัวตน ก็จะนำไปสู่ข้อสรุปแบบ Determinism หรือ Randomness แต่พุทธศาสนาปฏิเสธตัวตน ดังนั้นปัจจัยนั้นจึงไม่สามารถมาจากตัวตนได้ ในส่วนสุดท้ายคือ หากการกระทำไม่ได้เกิดจากปัจจัยใดๆ ก็เท่ากับว่าการกระทำนั้นเกิดขึ้นแบบสุ่ม ซึ่งไม่ถือว่าเป็น Free Will</p>
          </div>   
          <div className='paragraph'>
            <p>อีกทั้ง (Kumar & Sethy, 2021) ได้ยกหลักปฏิจจสมุปปาท มาเขียนเป็นรูปแบบประพจน์ได้ว่า “เมื่อ A มีอยู่ B มีอยู่, เมื่อ A กำลังเกิดขึ้น B เกิดขึ้น, เมื่อ A ไม่มีอยู่ B ไม่มีอยู่, เมื่อ A กำลังดับไป B ดับไป” เพื่อแสดงให้เห็นถึงความสัมพันธ์เชิงเหตุปัจจัย และอ้างว่าข้อโต้แย้งนี้แสดงให้เห็นว่ามีสาเหตุสำหรับการกระทำทุกอย่าง ซึ่งหมายความว่าการกระทำนั้นถูกกำหนดโดยเหตุปัจจัย ดังนั้นสามารถยืนยันได้ว่า พุทธศาสนาสนับสนุนแนวทาง Determinism (Kumar & Sethy, pp.211)</p>
          </div>   
          <div className='paragraph'>
            <p>ดังนั้น เมื่อพิจารณาเรื่องเหตุปัจจัยและเหตุการณ์เรื่องทหารตามหลักข้างต้นที่ว่าด้วยเรื่องเหตุปัจจัย การที่ถูกเกณฑ์ไปรบนั้น ทหารไม่ได้เลือกที่จะเข้าร่วมสงครามด้วยเจตจำนงเสรีของตนเองโดยสมบูรณ์ แต่เป็นผลมาจากเหตุปัจจัยหลายอย่าง เช่น สถานการณ์บ้านเมือง</p>
          </div>   
          <div className='paragraph'>
            <p>อย่างไรก็ดี การตีความหลักปฏิจจสมุปบาท หรือ Dependent Original ตามข้างต้น อาจดูเป็นการตีความที่ค่อนข้างสุดโต่ง และอาจยังมีจุดที่ต้องพิจารณา โดย Peter Harvey ได้เสนอว่า หลักปฏิจจสมุปบาทเป็นมัชฌิมาปฏิปทา กล่าวคือ หลักปฏิจจสมุปบาท ไม่ได้หมายความว่า อดีตของบุคคลจะกำหนดปัจจุบันและการกระทำของเขาอย่างตายตัว แต่เป็นแนวทางสายกลางระหว่าง ความเชื่อที่ว่า อดีตของบุคคลกำหนดธรรมชาติและการกระทำในปัจจุบันอย่างตายตัว และ ความเชื่อที่ว่า อดีตของบุคคลไม่เกี่ยวข้องกับธรรมชาติและการกระทำในปัจจุบัน บุคคลมีอิสระที่จะเลือกกระทำโดยสิ้นเชิง อีกทั้ง Harvey มองว่า หลักปฏิจจสมุปบาทแสดงให้เห็นว่าการกระทำในอดีต (กรรม) ส่งผลต่อปัจจุบัน แต่ไม่ได้กำหนดปัจจุบันอย่างสิ้นเชิง บุคคลยังคงมีอิสระในการเลือกกระทำในปัจจุบัน ซึ่งการกระทำในปัจจุบันนี้จะส่งผลต่ออนาคตต่อไป</p>
          </div>   
          <div className='paragraph'>
            <p>อีกทั้ง (Harvey, pp.43) ยังได้ชี้ให้เห็นถึงปัญหาการมองพุทธศาสนาว่าเป็นแบบ determinism ของ Charles Goodman ว่า หากจะมองในมุมมองดังกล่าวก็ยังไม่สามารถละทิ้งแนวคิดเรื่องความรับผิดชอบต่อการกระทำได้อย่างสมบูรณ์ และ Goodman ก็ยังมองว่ามนุษย์มีหน้าที่รับผิดชอบต่อการกระทำของตน แม้จะเชื่อว่าการกระทำนั้นถูกกำหนดโดยเหตุปัจจัยต่างๆ</p>
          </div>   
          <div className='paragraph'>
            <p>ดังนั้น หากมองการตีความหลักปฏิจจสมุปบาทแบบ Peter Harvey ที่ว่าหลักดังกล่าวคือจุดกึ่งกลางระหว่างขั้วทั้งสอง ก็อาจจะให้เราเห็นช่องว่างที่ว่า พุทธศาสนาก็ยังมีเจตจำนงเสรีบางประการให้กับมมุษย์อยู่</p>
          </div>   
          <div className='paragraph'>
            <p>หากลองพิจารณาเหตุการณ์ที่ทหารต้องไปทำสงครามและฆ่าคนว่าเป็นเรื่องของโชคชะตานั้น ก็จะหมายความว่ามนุษย์นั้นถูกกำหนดมาตั้งแต่แรกแล้วว่าให้ไปทำสงครามและต้องฆ่าคน ก็อาจดูว่าไม่มีเจตจำนงเสรี อย่างไรก็ดี หากมองในมุมมองทางพุทธศาสนา โลกทัศน์ทางพุทธนั้นปฏิเสธแนวคิดเรื่องโชคชะตา ที่กำหนดชีวิตมนุษย์อย่างตายตัวและสิ้นเชิง </p>
          </div>   
          <div className='paragraph'>
            <p>เมื่อพูดถึงเรื่องของโชคชะตา และ กรรม นั้น ในเชิงความหมายอาจมีส่วนที่ดูทับซ้อนกันว่าเป็นสิ่งที่ถูกกำหนดมาแล้ว แต่อย่างไรก็ดี ลักษณะของผลกรรมนั้นไม่เหมือนโชคชะตา กล่าวคือ ผลของกรรมสามารถปรับเปลี่ยนได้ผ่านการกระทำของแต่ละบุคคล (Sophorntavy, 2017) ก็ได้อธิบายเกี่ยวกับกฎแห่งกรรมในความคิดแบบพุทธว่า กรรมทำหน้าที่ในลักษณะที่กำหนดไว้ล่วงหน้า แต่ไม่ใช่แบบที่ตายตัว ในขณะเดียวกันก็ เน้นย้ำถึงความสามารถในการใช้เจตจำนงเสรีและการเปลี่ยนแปลงในแต่ละบุคคล</p>
          </div>   
          <div className='paragraph'>
            <p>Peter Harvey ได้ยกตัวอย่างเหตุการณ์ที่พระพุทธเจ้าไม่เห็นด้วยกับหลักคำสอนของ กลุ่มอาชิวิกา กลุ่มดังกล่าวมีความเชื่อที่ว่ามนุษย์ ไม่มีอำนาจควบคุมการกระทำของตนเอง เพราะทุกอย่างถูกกำหนดโดยโชคชะตา ซึ่งความเชื่อเช่นนี้ทำให้ มนุษย์ไม่ต้องรับผิดชอบต่อผลของการกระทำ เพราะไม่สามารถควบคุมการกระทำของตนได้ (Harvey, pp.40) อีกทั้ง การที่มีมุมมองว่าการที่ทุกอย่างกำหนดมาแล้ว มนุษย์ก็จะไม่พยายามทำความดี หรือ พัฒนาจิตใจให้หลุดพ้นจากกิเลส ซึ่งเป็นเป้าหมายสำคัญของพุทธศาสนา (Harvey, pp.43)</p>
          </div>   
          <div className='paragraph'>
            <p>แนวคิดเรื่องกรรมและเจตจำนงเสรีในพุทธศาสนานั้น อาจมองว่าเป็นเรื่องที่ดูสอดคล้องกัน อย่างไรก็ดี ในบางครั้งการมองกรรมอาจดูขัดแย้งกันในเรื่องที่ว่ากรรมที่เราทำอาจจะเป็นตัวกำหนดผลลัพธ์ในอนาคต ดังนั้นเราอาจจะดูไม่มีเจตจำนงเสรี แต่ประเด็นดังกล่าวควรต้องความเข้าใจเกี่ยวกับกรรมและฟังก์ชั่นของกรรมที่ถูกต้องก่อน การมองกรรมตามหลักพุทธศาสนา หมายถึงผลของการกระทำที่เกิดจาก เจตนา คือการกระทำที่มีความตั้งใจหรือ will ปรากฏอยู่ในรูปการณ์กระทำ (Repetti, pp.287) และตัวเจตนา ซึ่งคือความตั้งใจ ความจงใจ หรือความปรารถนาที่จะกระทำการใด ๆ จะเป็นเหมือนตัววัดและกำหนดลักษณะกรรม (Harvey, pp.48) เช่น หากมีเจตนาดี ก็จะนำไปสู่กรรมดี ก่อให้เกิดผลลัพธ์ที่ดีในอนาคต หรือ หากมีเจตนาชั่ว ก็จะนำไปสู่กรรมชั่ว ก่อให้เกิดผลลัพธ์ที่ไม่ดีในอนาคต</p>
          </div>   
          <div className='paragraph'>
            <p>เมื่อมองเจตจำนงเสรีในทางพุทธศาสนานั้น เจตจำนงเสรีดังกล่าวไม่ได้หมายถึงการให้อิสระโดยสิ้นเชิง แต่เป็นการให้มนุษย์ยังคงมีความสามารถในการเลือก และควบคุมการกระทำของตนเองอยู่ ในที่นี้ต้องไม่ลืมเรื่องการที่ต้องมีความรับผิดชอบในผลของการกระทำนั้นอยู่  เมื่อเราแยกทำความเข้าใจถึงเจตจำนงเสรีและกรรมใหม่แล้วนั้น อาจพบได้ถึงความสอดคล้องระหว่างหลักการทั้งสองอยู่ ประการแรกที่เห็นได้คือ กรรมเป็นผลของการที่เราใช้เจตจำนงเสรีของเราในการทำสิ่งใด ๆ ในที่นี้ จะเห็นว่าเรามีอำนาจในการเลือก ที่จะกระทำการอันเป็นกุศล หรืออกุศล ซึ่งการกระทำนั้น ๆ จะส่งผลเป็นกรรมดีหรือกรรมชั่วตามมา อีกทั้ง กรรมที่เราทำจะส่งผลต่อเจตจำนงเสรีในอนาคตของเรา คือ ในที่นี้อาจดูเหมือนว่ากรรมกับเจตจำนงเสรีเป็นเหมือนห่วงโซ่ที่คล้องต่อกันเป็นเหตุและผล กรรมที่เกิดจากการกระทำในอดีต จะ ส่งผลต่อชีวิตของเราในปัจจุบันและอนาคต เช่น การเกิดในภพภูมิที่ดีหรือไม่ดี การมีรูปกาย สติปัญญา (Harvey, pp.47) คือเราเลือกชีวิตเราเองและเราก็ต้องยอมรับผลของการกระทำที่ในอนาคต ประการถัดมาคือ เจตจำนงเสรีสามารถเปลี่ยนแปลงผลของกรรมได้ (Harvey, pp.56) ได้อธิบายว่าแม้ว่ากรรมในอดีตจะส่งผลต่อปัจจุบัน แต่ เรายังคงสามารถใช้เจตจำนงเสรีในการพัฒนาตนเอง เพื่อ ลดทอน หรือเปลี่ยนแปลงผลของกรรมได้ จากประเด็นความสอดคล้องของเจตจำนงเสรีกับกรรม เราจะเห็นได้ว่าพุทธศาสนาไม่ได้นำกรรมมาเป็นตัวกำหนดความเป็นไปของทุกสิ่งอย่างหลีกเลี่ยงไม่ได้ ในการกระทำใด ๆ ที่เราเลือกเรายังมีเจตจำนงเสรีบางประการอยู่</p>
          </div>   
          <div className='paragraph'>
            <p>อีกทั้ง (Griffiths, 1982) ได้ให้ข้อสนับสนุนที่ว่ามนุษย์ไม่ได้ถูกกำหนดมาแบบเด็ดขาด แต่ยังมีลักษณะบางประการที่อนุญาตให้มนุษย์ตัดสินใจในตัวเอง โดยยกข้อสนับสนุนที่ว่า กรรมไม่ได้กำหนดลักษณะบางประการอย่างเคร่งครัด รูปลักษณ์ภายนอก ข้อบกพร่องทางร่างกาย การเกิด ชนชั้นในสังคม และคุณธรรมของพ่อแม่ เป็นสิ่งที่กำหนดโดยผลกรรม อย่างไรก็ตาม เราสามารถเลือกที่จะใช้สิ่งที่มีอยู่ให้เกิดประโยชน์สูงสุด หรือปล่อยให้ข้อจำกัดเหล่านั้นฉุดรั้งเราลงได้ (Griffiths, pp.286)</p>
          </div>   
          <div className='paragraph'>
            <p>เมื่อพิจารณาเรื่องกรรมและทางเลือกบางประการที่พุทธศาสนายังพอให้ช่องทางกับมนุษย์ และนำมาเทียบกับเรื่องเหตุการณ์ของทหาร อาจมองได้ว่า ลักษณะที่ถูกบังคับมาเป็นทหาร ต้องฆ่ามนุษย์นั้น อาจเป็นผลมาจากกรรมที่ผ่านมาที่ทำให้ต้องพบเจอกับเรื่องดังกล่าว แต่ในลักษณะนี้เรายังพอเห็นช่องทางที่ว่าพุทธศาสนายังให้ตัวเลือกว่าเรายังเลือกที่จะฆ่าหรือไม่ฆ่าคนได้ แต่การเลือกนั้นอาจจะต้องแลกมาด้วยผลลัพธ์บางประการ หากทหารผู้นั้นเลือกหลักอหิงสา ก็อาจจะต้องแลกด้วยการที่จะต้องยอมเสียชีวิตของตนเอง</p>
          </div>   
          <div className='paragraph'>
            <p>จากข้อโต้แย้งและข้อสนับสนุนที่ยกมาข้างต้น เมื่อนำมาพิจารณากับเหตุการณ์ทหารที่ยกตัวอย่างข้างต้นนั้น อาจมองได้ว่า การที่เกิดสงครามและทำให้ทหารต้องมาอยู่ในสถานการณ์ที่ต้องฆ่าคนนั้น ทหารยังมีทางเลือกอยู่แม้จะถูกจำกัดก็ตาม ในเหตุการณ์นี้ หากทหารยอมทำตามคำสั่ง ทหารก็มีความจำเป็นที่ต้องฆ่าคนเพื่อการอยู่รอดของตนเอง แต่หากไม่ยอมทำตามคำสั่ง และเลือกเชื่อตามหลักที่ไม่เบียดเบียนผู้อื่น ทหารคนนั้นอาจจะต้องถูกฆ่าแทน เหตุการณ์นี้ ถึงแม้จะดูโหดร้าย แต่ยังให้เห็นว่าในสถานการณ์ที่ดูบีบบังคับเหมือนเป็นสิ่งที่ถูกกำหนดมาแล้ว ทหารยังมีเจตจำนงเสรีในการเลือกอยู่</p>
          </div>   
          <div className='paragraph'>
            <p>อย่างไรก็ดี การที่เกิดสงครามและนำไปสู่การที่เกิดเหตุการณ์เช่นนี้ ผู้เขียนยังมีความรู้สึกว่า หากเราเชื่อว่าเป็นเหตุปัจจัยที่อ้างอิงตามหลักปฏิจจสมุปบาท การเกิดเหตุการณ์ดังกล่าวเกิดจากกรรมเก่า หรือเหตุปัจจัยในอดีตที่ทหารคนนั้นได้ทำ จึงทำให้เขาตกอยู่ในสถานการณ์นี้ ย่อมเป็นสิ่งที่ยังไม่สามารถพิสูจน์ได้อยู่ดี การยกเรื่อง ชาติภพหรือกรรมเก่าของคนนั้น ๆ มาเพื่อเป็นตัวบอกว่าเขาจะตกอยู่ในสถานการณ์นี้อาจฟังดูไม่สมเหตุสมผล แต่หากเรามองเรื่องกรรมในมุมมองความเชื่อทางศาสนาตาม William James ก็ย่อมเป็นไปได้ แต่ในการศึกษาครั้งนี้ผู้เขียนมองว่าเป็นการศึกษาที่อยู่บนหลักของความเป็นเหตุผลที่สามารถพิสูจน์ได้ และไม่อยากใช้เรื่องกรรมเข้ามาอ้างในจุดนี้ การที่เขาต้องตกอยู่ในสถานการณ์นี้ หากไม่ใช่โชคชะตาตามที่พุทธศาสนาไม่เชื่อถือแล้วนั้น จะเป็นเหตุใด อาจเป็นประเด็นศึกษาต่อในอนาคต แต่การยกเหตุการณ์ดังกล่าวขึ้นมานั้น เรายังได้เห็นถึงความเป็นไปได้และมุมมองพุทธศาสนาต่อเจตจำนงเสรีว่าพุทธศาสนาก็ยังมีทางเลือก มอบเจตจำนงบางประการให้มนุษย์อยู่</p>
          </div>   
          <div className='paragraph'>
            <p></p>
          </div>   
        </div>

        {/* Author */}
        <Author />

        {/* Reference */}
        <div className='blog-reference'>
          <p className='h3'>Reference</p>
          {Reference.map((item) => (
            <ul className='p my-2 list-disc ml-4' key={item.id}>
            <li>
                <p>{item.name}</p>
                <Link href={item.link} className='link' target='_blank'>Get this reference →</Link>
            </li>
            </ul>      
          ))}    
        </div>  
        {/* Navigator */}          
    </div>
  )
}

export default BlogBuddhism